---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.AirSystemData.CoolingCoilType
source: html/24a82961-4f54-b21a-d120-46b7d1d3095e.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData.CoolingCoilType Property

The cooling coil type. Note this property change would reset the chilled water loop.

## Syntax (C#)
```csharp
public AirCoolingCoilType CoolingCoilType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration